# This Sigma rule is designed to detect the DLL sideloading technique using toshdpdb.exe and the malicious toshdpapi.dll associated with Mustang Panda's PlugX deployment.

title: Suspicious User Process Creation
id: 8d495bd6-f306-49af-86ce-ff784c9dbb6d
status: 
description: Detects a sideloading technique using toshdpdb.exe
references:
    - https://www.security.com/threat-intelligence/chinese-espionage-ransomware
    - https://thehackernews.com/2025/02/hackers-exploited-pan-os-flaw-to-deploy.html
author: Jaspreet S
date: 2025-02-15
modified: 
logsource:
    category: process_creation
    product: windows
detection:
    selection_1:
        Image|endswith: '\toshdpdb.exe'
        ImageLoaded|endswith: '\toshdpapi.dll'
    selection_2:
        ParentImage|endswith: '\toshdpdb.exe'
        ImageLoaded|endswith: '\toshdpapi.dll'
    condition: selection_1 or  selection_2
